zhanzr/N32G45XVL-STB_V1_1/Driver/n32g45x_std_periph_driver/src/n32g457_eth.c
    /* Check if segment is not owned by DMA */
    if ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_OWN) == (uint32_t)RESET)
    {
        /* Check if last segment */
        if ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_LS) != (uint32_t)RESET)
        {
            /* Increment segment count */
            (DMARxFrameInfos->SegmentCount)++;

            /* Check if last segment is first segment: one segment contains the frame */
            if ((DMARxFrameInfos->SegmentCount) == 1)
            {
                DMARxFrameInfos->FirstSegmentRxDesc = DMARxDescToGet;
            }

            DMARxFrameInfos->LastSegmentRxDesc = DMARxDescToGet;

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            frame.length = ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_FL) >> 16) - 4;
            /* Get the address of the buffer start address */
            frame.buffer =(DMARxFrameInfos->FirstSegmentRxDesc)->Buf1Addr;
            
            /* Point to next descriptor */
            DMARxDescToGet = (ETH_DMADescType*)(DMARxDescToGet->Buf2OrNextDescAddr);

            /* Return Frame */
            return (frame);
        }
        /* Check if first segment */
        else if ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_FS) != (uint32_t)RESET)
        {
            DMARxFrameInfos->FirstSegmentRxDesc = DMARxDescToGet;
            DMARxFrameInfos->LastSegmentRxDesc = NULL;
            DMARxFrameInfos->SegmentCount = 1;
            /* Point to next descriptor */
            DMARxDescToGet = (ETH_DMADescType*)(DMARxDescToGet->Buf2OrNextDescAddr);
        }
        /* Check if intermediate segment */
        else
        {
            (DMARxFrameInfos->SegmentCount)++;
            /* Point to next descriptor */
            DMARxDescToGet = (ETH_DMADescType*)(DMARxDescToGet->Buf2OrNextDescAddr);
        }
    }

    /* Return Frame */
    return (frame);
}

/**
  * @brief  This function should be called when a frame is received using DMA
  *         Receive interrupt, it allows scanning of Rx descriptors to get the
  *         the receive frame (should be used with interrupt mode only)
  * @param  None
  * @return Structure of type ETH_FrameType
  */
ETH_FrameType ETH_GetReceivedFrameInterrupt(void)
{ 
    ETH_FrameType frame = {0,0,0};
    __IO uint32_t descriptorScanCounter = 0;

    /* scan descriptors owned by CPU */
    while (((DMARxDescToGet->Status & ETH_DMA_RX_DESC_OWN) == (uint32_t)RESET) &&
        (descriptorScanCounter < ETH_RXBUFNB))
    {

        /* Just by security */
        descriptorScanCounter++;

        /* check if first segment in frame */
        if(((DMARxDescToGet->Status & ETH_DMA_RX_DESC_FS) != (uint32_t)RESET) &&
            ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_LS) == (uint32_t)RESET))
        {
            DMARxFrameInfos->FirstSegmentRxDesc = DMARxDescToGet;
            DMARxFrameInfos->SegmentCount = 1;
            /* Point to next descriptor */
            DMARxDescToGet = (ETH_DMADescType*)(DMARxDescToGet->Buf2OrNextDescAddr);
        }
        /* check if intermediate segment */
        else if (((DMARxDescToGet->Status & ETH_DMA_RX_DESC_LS) == (uint32_t)RESET) &&
                ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_FS) == (uint32_t)RESET))
        {
            /* Increment segment count */
            (DMARxFrameInfos->SegmentCount)++;
            /* Point to next descriptor */
            DMARxDescToGet = (ETH_DMADescType*)(DMARxDescToGet->Buf2OrNextDescAddr);
        }
        /* should be last segment */
        else
        {
            /* last segment */
            DMARxFrameInfos->LastSegmentRxDesc = DMARxDescToGet;
            /* Increment segment count */
            (DMARxFrameInfos->SegmentCount)++;
            
            /* first segment is last segment */
            if ((DMARxFrameInfos->SegmentCount) == 1)
            {
                DMARxFrameInfos->FirstSegmentRxDesc = DMARxDescToGet;
            }
            
            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            frame.length = ((DMARxDescToGet->Status & ETH_DMA_RX_DESC_FL) >> 16) - 4;

            /* Get the address of the buffer start address */
            frame.buffer = (DMARxFrameInfos->FirstSegmentRxDesc)->Buf1Addr;
            /* Point to next descriptor */
            DMARxDescToGet = (ETH_DMADescType*)(DMARxDescToGet->Buf2OrNextDescAddr);
            
            /* Return Frame */
            return (frame);
        }
    }
    return (frame);
}

/**
  * @brief  Prepares DMA Tx descriptors to transmit an ethernet frame
  * @param  FrameLength : length of the frame to send
  * @return error status
  */
uint32_t ETH_PrepareTransmitDescriptors(uint16_t FrameLength)
{   
    __IO uint32_t bufCount = 0, size = 0, i = 0;
    
    if (FrameLength == 0)
    {
        /* Return ERROR */
        return ETH_ERROR;
    }

    /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
    if((DMATxDescToSet->Status & ETH_DMA_TX_DESC_OWN) != (uint32_t)RESET)
    {  
        /* Return ERROR: OWN bit set */
        return ETH_ERROR;
    }

    if (FrameLength > ETH_TX_BUF_SIZE)
    {
        bufCount = FrameLength / ETH_TX_BUF_SIZE;
        if (FrameLength % ETH_TX_BUF_SIZE)
        {
            bufCount++;
        }
    }
    else
    {
        bufCount = 1;
    }

    if (bufCount == 1)
    {
        /*set LAST and FIRST segment */
        DMATxDescToSet->CtrlOrBufSize |= (ETH_DMA_TX_DESC_FS | ETH_DMA_TX_DESC_LS);
        /* Set frame size */
        DMATxDescToSet->CtrlOrBufSize &= (~ETH_DMA_TX_DESC_TBS1);
        DMATxDescToSet->CtrlOrBufSize |= (FrameLength & ETH_DMA_TX_DESC_TBS1);
        /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
        DMATxDescToSet->Status |= ETH_DMA_TX_DESC_OWN;
        /* Point to next descriptor */
        DMATxDescToSet = (ETH_DMADescType *)(DMATxDescToSet->Buf2OrNextDescAddr);
    }
    else
    {
        for (i = 0; i< bufCount; i++)
        {
            /* Clear FIRST and LAST segment bits */
            DMATxDescToSet->CtrlOrBufSize &= (~(ETH_DMA_TX_DESC_FS | ETH_DMA_TX_DESC_LS));
            
            if (i == 0)
            {
                /* Setting the first segment bit */
                DMATxDescToSet->CtrlOrBufSize |= ETH_DMA_TX_DESC_FS;
            }
            
            /* Program size */
            DMATxDescToSet->CtrlOrBufSize &= (~ETH_DMA_TX_DESC_TBS1);
            DMATxDescToSet->CtrlOrBufSize |= (ETH_TX_BUF_SIZE & ETH_DMA_TX_DESC_TBS1);
            
