zhanzr/N32G45XVL-STB_V1_1/Driver/n32g45x_std_periph_driver/src/n32g457_eth.c
            if (i == (bufCount - 1))
            {
                /* Setting the last segment bit */
                DMATxDescToSet->CtrlOrBufSize |= ETH_DMA_TX_DESC_LS;
                size = FrameLength - (bufCount - 1) * ETH_TX_BUF_SIZE;
                DMATxDescToSet->CtrlOrBufSize &= (~ETH_DMA_TX_DESC_TBS1);
                DMATxDescToSet->CtrlOrBufSize |= (size & ETH_DMA_TX_DESC_TBS1);
            }
            
            /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
            DMATxDescToSet->Status |= ETH_DMA_TX_DESC_OWN;
            /* Point to next descriptor */
            DMATxDescToSet = (ETH_DMADescType *)(DMATxDescToSet->Buf2OrNextDescAddr);
        }
    }

    /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
    if ((ETH->DMASTS & ETH_DMASTS_TU) != (uint32_t)RESET)
    {
        /* Clear TBUS ETHERNET DMA flag */
        ETH->DMASTS = ETH_DMASTS_TU;
        /* Resume DMA transmission*/
        ETH->DMATXPD = 0;
    }

    /* Return SUCCESS */
    return ETH_SUCCESS;
}

/**
  * @brief  Initializes the DMA Rx descriptors in chain mode.
  * @param  DMARxDescTab: Pointer on the first Rx desc list
  * @param  RxBuff: Pointer on the first RxBuffer list
  * @param  RxBuffCount: Number of the used Rx desc in the list
  * @return None
  */
void ETH_DMARxDescChainInit(ETH_DMADescType *DMARxDescTab, uint8_t *RxBuff, uint32_t RxBuffCount)
{
    __IO uint32_t i = 0;
    __IO ETH_DMADescType *DMARxDesc = NULL;

    /* Set the DMARxDescToGet pointer with the first one of the DMARxDescTab list */
    DMARxDescToGet = DMARxDescTab;
    /* Fill each DMARxDesc descriptor with the right values */
    for (i = 0; i < RxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Rx Desc list */
        DMARxDesc = DMARxDescTab + i;
        /* Set Own bit of the Rx descriptor Status */
        DMARxDesc->Status = ETH_DMA_RX_DESC_OWN;

        /* Set Buffer1 size and Second Address Chained bit */
        DMARxDesc->CtrlOrBufSize = (ETH_DMA_RX_DESC_RCH | (uint32_t)ETH_RX_BUF_SIZE);
        /* Set Buffer1 address pointer */
        DMARxDesc->Buf1Addr = (uint32_t)(&RxBuff[i * ETH_RX_BUF_SIZE]);

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if (i < (RxBuffCount - 1))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMARxDesc->Buf2OrNextDescAddr = (uint32_t)(DMARxDescTab + i + 1);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMARxDesc->Buf2OrNextDescAddr = (uint32_t)(DMARxDescTab);
        }
    }

    /* Set Receive Descriptor List Address Register */
    ETH->DMARXDLADDR = (uint32_t)DMARxDescTab;

    DMARxFrameInfos = &sRxFrameInfos;
}

/**
  * @brief  Initializes the DMA Tx descriptors in chain mode.
  * @param  DMATxDescTab: Pointer on the first Tx desc list 
  * @param  TxBuff: Pointer on the first TxBuffer list
  * @param  TxBuffCount: Number of the used Tx desc in the list
  * @return None
  */
void ETH_DMATxDescChainInit(ETH_DMADescType *DMATxDescTab, uint8_t* TxBuff, uint32_t TxBuffCount)
{
    __IO uint32_t i = 0;
    __IO ETH_DMADescType *DMATxDesc = NULL;

    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    DMATxDescToSet = DMATxDescTab;
    /* Fill each DMATxDesc descriptor with the right values */
    for (i = 0; i < TxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Tx Desc list */
        DMATxDesc = DMATxDescTab + i;
        /* Set Second Address Chained bit */
        DMATxDesc->CtrlOrBufSize = ETH_DMA_TX_DESC_TCH;

        /* Set Buffer1 address pointer */
        DMATxDesc->Buf1Addr = (uint32_t)(&TxBuff[i * ETH_TX_BUF_SIZE]);

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if (i < (TxBuffCount - 1))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMATxDesc->Buf2OrNextDescAddr = (uint32_t)(DMATxDescTab + i + 1);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMATxDesc->Buf2OrNextDescAddr = (uint32_t)DMATxDescTab;
        }
    }

    /* Set Transmit Desciptor List Address Register */
    ETH->DMATXDLADDR = (uint32_t)DMATxDescTab;
}

/**
  * @brief  Checks whether the specified ETHERNET DMA Tx Desc flag is set or not.
  * @param  DMATxDesc: pointer on a DMA Tx descriptor
  * @param  ETH_DMATxDescFlag: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_TX_DESC_OWN : OWN bit: descriptor is owned by DMA engine
  *     @arg ETH_DMA_TX_DESC_TTSS: Tx Time Stamp Status
  *     @arg ETH_DMA_TX_DESC_IHE : IP Header Error
  *     @arg ETH_DMA_TX_DESC_ES  : Error summary
  *     @arg ETH_DMA_TX_DESC_JT  : Jabber Timeout
  *     @arg ETH_DMA_TX_DESC_FF  : Frame Flushed: DMA/MTL flushed the frame due to SW flush
  *     @arg ETH_DMA_TX_DESC_PCE : Payload Checksum Error
  *     @arg ETH_DMA_TX_DESC_LCA : Loss of Carrier: carrier lost during transmission
  *     @arg ETH_DMA_TX_DESC_NC  : No Carrier: no carrier signal from the transceiver
  *     @arg ETH_DMA_TX_DESC_LCO : Late Collision: transmission aborted due to collision
  *     @arg ETH_DMA_TX_DESC_EC  : Excessive Collision: transmission aborted after 16 collisions
  *     @arg ETH_DMA_TX_DESC_VF  : VLAN Frame
  *     @arg ETH_DMA_TX_DESC_CC  : Collision Count
  *     @arg ETH_DMA_TX_DESC_ED  : Excessive Deferral
  *     @arg ETH_DMA_TX_DESC_UF  : Underflow Error: late data arrival from the memory
  *     @arg ETH_DMA_TX_DESC_DB  : Deferred Bit
  * @return The new state of ETH_DMATxDescFlag (SET or RESET).
  */
FlagStatus ETH_GetDMATxDescFlagStatus(ETH_DMADescType *DMATxDesc, uint32_t ETH_DMATxDescFlag)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMATXDESC_GET_FLAG(ETH_DMATxDescFlag));

    if ((DMATxDesc->Status & ETH_DMATxDescFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
  * @brief  Returns the specified ETHERNET DMA Tx Desc collision count.
  * @param  DMATxDesc: pointer on a DMA Tx descriptor
  * @return The Transmit descriptor collision counter value.
  */
uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADescType *DMATxDesc)
{
    /* Return the Receive descriptor frame length */
    return ((DMATxDesc->Status & ETH_DMA_TX_DESC_CC) >> 3);
}

/**
  * @brief  Set the specified DMA Tx Desc Own bit.
  * @param  DMATxDesc: Pointer on a Tx desc
  * @return None
  */
void ETH_SetDMATxDescOwnBit(ETH_DMADescType *DMATxDesc)
{
    /* Set the DMA Tx Desc Own bit */
    DMATxDesc->Status |= ETH_DMA_TX_DESC_OWN;
}

/**
  * @brief  Enables or disables the specified DMA Tx Desc Transmit interrupt.
  * @param  DMATxDesc: Pointer on a Tx desc
  * @param  NewState: new state of the DMA Tx Desc transmit interrupt.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMATxDescTransmitITConfig(ETH_DMADescType *DMATxDesc, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the DMA Tx Desc Transmit interrupt */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_IC;
    }
    else
    {
        /* Disable the DMA Tx Desc Transmit interrupt */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_IC);
    }
}

/**
  * @brief  configure Tx descriptor as last or first segment
  * @param  DMATxDesc: Pointer on a Tx desc
  * @param  DMATxDesc_FrameSegment: specifies is the actual Tx desc contain last or first segment.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_TX_DESC_LAST_SEGMENT  : actual Tx desc contain last segment 
  *     @arg ETH_DMA_TX_DESC_FIRST_SEGMENT : actual Tx desc contain first segment
  * @return None
  */
void ETH_DMATxDescFrameSegmentConfig(ETH_DMADescType *DMATxDesc, uint32_t DMATxDesc_FrameSegment)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_TX_DESC_SEGMENT(DMATxDesc_FrameSegment));

    /* Selects the DMA Tx Desc Frame segment */
    DMATxDesc->CtrlOrBufSize |= DMATxDesc_FrameSegment;
}

/**
  * @brief  Selects the specified ETHERNET DMA Tx Desc Checksum Insertion.
  * @param  DMATxDesc: pointer on a DMA Tx descriptor 
  * @param  DMATxDesc_Checksum: specifies is the DMA Tx desc checksum insertion.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_TX_DESC_CHECKSUM_BYPASS : Checksum bypass
  *     @arg ETH_DMA_TX_DESC_CHECKSUM_IPV4_HEADER : IPv4 header checksum
  *     @arg ETH_DMA_TX_DESC_CHECKSUM_TCPUDPICMP_SEGMENT : TCP/UDP/ICMP checksum. Pseudo header checksum is assumed to be present
  *     @arg ETH_DMA_TX_DESC_CHECKSUM_TCPUDPICMP_FULL : TCP/UDP/ICMP checksum fully in hardware including pseudo header
  * @return None
  */
void ETH_DMATxDescChecksumInsertionConfig(ETH_DMADescType *DMATxDesc, uint32_t DMATxDesc_Checksum)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_TX_DESC_CHECKSUM(DMATxDesc_Checksum));

    /* Set the selected DMA Tx desc checksum insertion control */
    DMATxDesc->CtrlOrBufSize |= DMATxDesc_Checksum;
}

/**
  * @brief  Enables or disables the DMA Tx Desc CRC.
  * @param  DMATxDesc: pointer on a DMA Tx descriptor
  * @param  NewState: new state of the specified DMA Tx Desc CRC.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMATxDescCRCCmd(ETH_DMADescType *DMATxDesc, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected DMA Tx Desc CRC */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_DC);
    }
    else
    {
        /* Disable the selected DMA Tx Desc CRC */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_DC;
    }
}

/**
  * @brief  Enables or disables the DMA Tx Desc second address chained.
  * @param  DMATxDesc: pointer on a DMA Tx descriptor
  * @param  NewState: new state of the specified DMA Tx Desc second address chained.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADescType *DMATxDesc, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected DMA Tx Desc second address chained */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_TCH;
    }
    else
    {
        /* Disable the selected DMA Tx Desc second address chained */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_TCH);
    }
}

/**
  * @brief  Enables or disables the DMA Tx Desc padding for frame shorter than 64 bytes.
  * @param  DMATxDesc: pointer on a DMA Tx descriptor
  * @param  NewState: new state of the specified DMA Tx Desc padding for frame shorter than 64 bytes.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMATxDescShortFramePaddingCmd(ETH_DMADescType *DMATxDesc, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected DMA Tx Desc padding for frame shorter than 64 bytes */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_DP);
    }
    else
    {
        /* Disable the selected DMA Tx Desc padding for frame shorter than 64 bytes*/
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_DP; 
    }
}

/**
  * @brief  Configures the specified DMA Tx Desc buffer1 and buffer2 sizes.
  * @param  DMATxDesc: Pointer on a Tx desc
  * @param  BufferSize1: specifies the Tx desc buffer1 size.
  * @param  BufferSize2: specifies the Tx desc buffer2 size (put "0" if not used).
  * @return None
  */
void ETH_DMATxDescBufferSizeConfig(ETH_DMADescType *DMATxDesc, uint32_t BufferSize1, uint32_t BufferSize2)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_TX_DESC_BUFFER_SIZE(BufferSize1));
    assert_param(IS_ETH_DMA_TX_DESC_BUFFER_SIZE(BufferSize2));

    /* Set the DMA Tx Desc buffer1 and buffer2 sizes values */
    DMATxDesc->CtrlOrBufSize |= (BufferSize1 | (BufferSize2 << 11));
}

/**
  * @brief  Checks whether the specified ETHERNET Rx Desc flag is set or not.
  * @param  DMARxDesc: pointer on a DMA Rx descriptor
  * @param  ETH_DMARxDescFlag: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_RX_DESC_OWN:         OWN bit: descriptor is owned by DMA engine 
  *     @arg ETH_DMA_RX_DESC_AFM:         DA Filter Fail for the rx frame
  *     @arg ETH_DMA_RX_DESC_ES:          Error summary
  *     @arg ETH_DMA_RX_DESC_DE:          Descriptor error: no more descriptors for receive frame
  *     @arg ETH_DMA_RX_DESC_SAF:         SA Filter Fail for the received frame
  *     @arg ETH_DMA_RX_DESC_LE:          Frame size not matching with length field
  *     @arg ETH_DMA_RX_DESC_OE:          Overflow Error: Frame was damaged due to buffer overflow
  *     @arg ETH_DMA_RX_DESC_VLAN:        VLAN Tag: received frame is a VLAN frame
  *     @arg ETH_DMA_RX_DESC_FS:          First descriptor of the frame
  *     @arg ETH_DMA_RX_DESC_LS:          Last descriptor of the frame
  *     @arg ETH_DMA_RX_DESC_IPV4HCE:     IPC Checksum Error/Giant Frame: Rx Ipv4 header checksum error 
  *     @arg ETH_DMA_RX_DESC_LC:          Late collision occurred during reception
  *     @arg ETH_DMA_RX_DESC_FT:          Frame type - Ethernet, otherwise 802.3
  *     @arg ETH_DMA_RX_DESC_RWT:         Receive Watchdog Timeout: watchdog timer expired during reception
  *     @arg ETH_DMA_RX_DESC_RE:          Receive error: error reported by MII interface
  *     @arg ETH_DMA_RX_DESC_DBE:         Dribble bit error: frame contains non int multiple of 8 bits
  *     @arg ETH_DMA_RX_DESC_CE:          CRC error
  *     @arg ETH_DMA_RX_DESC_RMAPCE:      Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error
  * @return The new state of ETH_DMARxDescFlag (SET or RESET).
  */
FlagStatus ETH_GetDMARxDescFlagStatus(ETH_DMADescType *DMARxDesc, uint32_t ETH_DMARxDescFlag)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_RX_DESC_GET_FLAG(ETH_DMARxDescFlag));
    if ((DMARxDesc->Status & ETH_DMARxDescFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
  * @brief  Set the specified DMA Rx Desc Own bit.
  * @param  DMARxDesc: Pointer on a Rx desc
  * @return None
  */
void ETH_SetDMARxDescOwnBit(ETH_DMADescType *DMARxDesc)
{
    /* Set the DMA Rx Desc Own bit */
    DMARxDesc->Status |= ETH_DMA_RX_DESC_OWN;
}

/**
  * @brief  Returns the specified DMA Rx Desc frame length.
  * @param  DMARxDesc: pointer on a DMA Rx descriptor
  * @return The Rx descriptor received frame length.
  */
uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADescType *DMARxDesc)
{
    /* Return the Receive descriptor frame length */
    return ((DMARxDesc->Status & ETH_DMA_RX_DESC_FL) >> 16);
}

/**
  * @brief  Enables or disables the specified DMA Rx Desc receive interrupt.
  * @param  DMARxDesc: Pointer on a Rx desc
  * @param  NewState: new state of the specified DMA Rx Desc interrupt.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMARxDescReceiveITConfig(ETH_DMADescType *DMARxDesc, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the DMA Rx Desc receive interrupt */
        DMARxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_RX_DESC_DIC);
    }
    else
    {
        /* Disable the DMA Rx Desc receive interrupt */
        DMARxDesc->CtrlOrBufSize |= ETH_DMA_RX_DESC_DIC;
    }
}

/**
  * @brief  Returns the specified ETHERNET DMA Rx Desc buffer size.
  * @param  DMARxDesc: pointer on a DMA Rx descriptor 
  * @param  DMARxDesc_Buffer: specifies the DMA Rx Desc buffer.
  *   This parameter can be any one of the following values:
  *     @arg ETH_DMA_RX_DESC_BUFFER1 : DMA Rx Desc Buffer1
  *     @arg ETH_DMA_RX_DESC_BUFFER2 : DMA Rx Desc Buffer2
  * @return The Receive descriptor frame length.
  */
uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADescType *DMARxDesc, uint32_t DMARxDesc_Buffer)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_RXDESC_BUFFER(DMARxDesc_Buffer));

    if (DMARxDesc_Buffer != ETH_DMA_RX_DESC_BUFFER1)
    {
        /* Return the DMA Rx Desc buffer2 size */
        return ((DMARxDesc->CtrlOrBufSize & ETH_DMA_RX_DESC_RBS2) >> 11);
    }
    else
    {
        /* Return the DMA Rx Desc buffer1 size */
        return (DMARxDesc->CtrlOrBufSize & ETH_DMA_RX_DESC_RBS1);
    }
}

/**
  * @brief  Get the size of the received packet.
  * @param  None
  * @return framelength: received packet size
  */
uint32_t ETH_GetRxPacketSize(ETH_DMADescType *DMARxDesc)
{
    uint32_t frameLength = 0;

    if (((DMARxDesc->Status & ETH_DMA_RX_DESC_OWN) == (uint32_t)RESET) &&
        ((DMARxDesc->Status & ETH_DMA_RX_DESC_ES)  == (uint32_t)RESET) &&
        ((DMARxDesc->Status & ETH_DMA_RX_DESC_LS)  != (uint32_t)RESET))
    {
        /* Get the size of the packet: including 4 bytes of the CRC */
        frameLength =  ETH_GetDMARxDescFrameLength(DMARxDesc);
    }

    /* Return Frame Length */
    return frameLength;
}


/******************************************************************************/
/*                           DMA functions                                    */
/******************************************************************************/

/**
  * @brief  Resets all MAC subsystem internal registers and logic.
  * @param  None
  * @return None
  */
void ETH_SoftwareReset(void)
{
    /* Set the SWR bit: resets all MAC subsystem internal registers and logic */
    /* After reset all the registers holds their respective reset values */
    ETH->DMABUSMOD |= ETH_DMABUSMOD_SWR;
}

/**
  * @brief  Checks whether the ETHERNET software reset bit is set or not.
  * @param  None
  * @return The new state of DMA Bus Mode register SR bit (SET or RESET).
  */
FlagStatus ETH_GetSoftwareResetStatus(void)
{
    FlagStatus bitstatus = RESET;
    if ((ETH->DMABUSMOD & ETH_DMABUSMOD_SWR) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
  * @brief  Checks whether the specified ETHERNET DMA flag is set or not.
  * @param  ETH_DMA_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_FLAG_TST                 : Time-stamp trigger flag
  *     @arg ETH_DMA_FLAG_PMT                 : PMT flag 
  *     @arg ETH_DMA_FLAG_MMC                 : MMC flag 
  *     @arg ETH_DMA_FLAG_DATA_TRANSFER_ERROR : Error bits 0-data buffer, 1-desc. access
  *     @arg ETH_DMA_FLAG_READ_WRITE_ERROR    : Error bits 0-write trnsf, 1-read transfr
  *     @arg ETH_DMA_FLAG_ACCESS_ERROR        : Error bits 0-Rx DMA, 1-Tx DMA
  *     @arg ETH_DMA_FLAG_NIS                 : Normal interrupt summary flag
  *     @arg ETH_DMA_FLAG_AIS                 : Abnormal interrupt summary flag  
  *     @arg ETH_DMA_FLAG_EARLY_RX            : Early receive flag 
  *     @arg ETH_DMA_FLAG_FATAL_BUS_ERROR     : Fatal bus error flag 
  *     @arg ETH_DMA_FLAG_EARLY_TX            : Early transmit flag 
  *     @arg ETH_DMA_FLAG_RX_WDG_TIMEOUT      : Receive watchdog timeout flag 
  *     @arg ETH_DMA_FLAG_RX_PROC_STOP        : Receive process stopped flag 
  *     @arg ETH_DMA_FLAG_RX_BUF_UA           : Receive buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_RX                  : Receive flag 
  *     @arg ETH_DMA_FLAG_TX_UNDERFLOW        : Underflow flag 
  *     @arg ETH_DMA_FLAG_RX_OVERFLOW         : Overflow flag 
  *     @arg ETH_DMA_FLAG_TX_JABBER_TIMEOUT   : Transmit jabber timeout flag 
  *     @arg ETH_DMA_FLAG_TX_BUF_UA           : Transmit buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_TX_PROC_STOP        : Transmit process stopped flag 
  *     @arg ETH_DMA_FLAG_TX                  : Transmit flag 
  * @return The new state of ETH_DMA_FLAG (SET or RESET).
  */
FlagStatus ETH_GetDMAFlagStatus(uint32_t ETH_DMA_FLAG)
{  
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_GET_FLAG(ETH_DMA_FLAG));
    if ((ETH->DMASTS & ETH_DMA_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
  * @brief  Clears the ETHERNET’s DMA pending flag.
  * @param  ETH_DMA_FLAG: specifies the flag to clear.
  *   This parameter can be any combination of the following values:
  *     @arg ETH_DMA_FLAG_NIS                 : Normal interrupt summary flag
  *     @arg ETH_DMA_FLAG_AIS                 : Abnormal interrupt summary flag  
  *     @arg ETH_DMA_FLAG_EARLY_RX            : Early receive flag 
  *     @arg ETH_DMA_FLAG_FATAL_BUS_ERROR     : Fatal bus error flag 
  *     @arg ETH_DMA_FLAG_EARLY_TX            : Early transmit flag 
  *     @arg ETH_DMA_FLAG_RX_WDG_TIMEOUT      : Receive watchdog timeout flag 
  *     @arg ETH_DMA_FLAG_RX_PROC_STOP        : Receive process stopped flag 
  *     @arg ETH_DMA_FLAG_RX_BUF_UA           : Receive buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_RX                  : Receive flag 
  *     @arg ETH_DMA_FLAG_TX_UNDERFLOW        : Underflow flag 
  *     @arg ETH_DMA_FLAG_RX_OVERFLOW         : Overflow flag 
  *     @arg ETH_DMA_FLAG_TX_JABBER_TIMEOUT   : Transmit jabber timeout flag 
  *     @arg ETH_DMA_FLAG_TX_BUF_UA           : Transmit buffer unavailable flag 
  *     @arg ETH_DMA_FLAG_TX_PROC_STOP        : Transmit process stopped flag 
  *     @arg ETH_DMA_FLAG_TX                  : Transmit flag 
  * @return None
  */
void ETH_DMAClearFlag(uint32_t ETH_DMA_FLAG)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_FLAG(ETH_DMA_FLAG));

    /* Clear the selected ETHERNET DMA FLAG */
    ETH->DMASTS = (uint32_t) ETH_DMA_FLAG;
}

