zhanzr/N32G45XVL-STB_V1_1/Driver/n32g45x_std_periph_driver/src/n32g457_eth.c
/**
  * @brief  Enables or disables the specified ETHERNET DMA interrupts.
  * @param  ETH_DMA_IT: specifies the ETHERNET DMA interrupt sources to be
  *   enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg ETH_DMA_INT_NIS                  : Normal interrupt summary
  *     @arg ETH_DMA_INT_AIS                  : Abnormal interrupt summary
  *     @arg ETH_DMA_INT_EARLY_RX             : Early receive interrupt
  *     @arg ETH_DMA_INT_FATAL_BUS_ERROR      : Fatal bus error interrupt
  *     @arg ETH_DMA_INT_EARLY_TX             : Early transmit interrupt
  *     @arg ETH_DMA_INT_RX_WDG_TIMEOUT       : Receive watchdog timeout interrupt
  *     @arg ETH_DMA_INT_RX_PROC_STOP         : Receive process stopped interrupt
  *     @arg ETH_DMA_INT_RX_BUF_UA            : Receive buffer unavailable interrupt
  *     @arg ETH_DMA_INT_RX                   : Receive interrupt
  *     @arg ETH_DMA_INT_TX_UNDERFLOW         : Underflow interrupt
  *     @arg ETH_DMA_INT_RX_OVERFLOW          : Overflow interrupt
  *     @arg ETH_DMA_INT_TX_JABBER_TIMEOUT    : Transmit jabber timeout interrupt
  *     @arg ETH_DMA_INT_TX_BUF_UA            : Transmit buffer unavailable interrupt
  *     @arg ETH_DMA_INT_TX_PROC_STOP         : Transmit process stopped interrupt
  *     @arg ETH_DMA_INT_TX                   : Transmit interrupt
  * @param  NewState: new state of the specified ETHERNET DMA interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMAITConfig(uint32_t ETH_DMA_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_INT(ETH_DMA_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the selected ETHERNET DMA interrupts */
        ETH->DMAINTEN |= ETH_DMA_IT;
    }
    else
    {
        /* Disable the selected ETHERNET DMA interrupts */
        ETH->DMAINTEN &= (~(uint32_t)ETH_DMA_IT);
    }
}

/**
  * @brief  Checks whether the specified ETHERNET DMA interrupt has occurred or not.
  * @param  ETH_DMA_IT: specifies the interrupt source to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_INT_NIS                  : Normal interrupt summary
  *     @arg ETH_DMA_INT_AIS                  : Abnormal interrupt summary
  *     @arg ETH_DMA_INT_EARLY_RX             : Early receive interrupt
  *     @arg ETH_DMA_INT_FATAL_BUS_ERROR      : Fatal bus error interrupt
  *     @arg ETH_DMA_INT_EARLY_TX             : Early transmit interrupt
  *     @arg ETH_DMA_INT_RX_WDG_TIMEOUT       : Receive watchdog timeout interrupt
  *     @arg ETH_DMA_INT_RX_PROC_STOP         : Receive process stopped interrupt
  *     @arg ETH_DMA_INT_RX_BUF_UA            : Receive buffer unavailable interrupt
  *     @arg ETH_DMA_INT_RX                   : Receive interrupt
  *     @arg ETH_DMA_INT_TX_UNDERFLOW         : Underflow interrupt
  *     @arg ETH_DMA_INT_RX_OVERFLOW          : Overflow interrupt
  *     @arg ETH_DMA_INT_TX_JABBER_TIMEOUT    : Transmit jabber timeout interrupt
  *     @arg ETH_DMA_INT_TX_BUF_UA            : Transmit buffer unavailable interrupt
  *     @arg ETH_DMA_INT_TX_PROC_STOP         : Transmit process stopped interrupt
  *     @arg ETH_DMA_INT_TX                   : Transmit interrupt
  * @return The new state of ETH_DMA_IT (SET or RESET).
  */
INTStatus ETH_GetDMAITStatus(uint32_t ETH_DMA_IT)
{  
    INTStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_GET_INT(ETH_DMA_IT));
    if ((ETH->DMASTS & ETH_DMA_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
  * @brief  Clears the ETHERNET’s DMA IT pending bit.
  * @param  ETH_DMA_IT: specifies the interrupt pending bit to clear.
  *   This parameter can be any combination of the following values:
  *     @arg ETH_DMA_INT_NIS                  : Normal interrupt summary
  *     @arg ETH_DMA_INT_AIS                  : Abnormal interrupt summary
  *     @arg ETH_DMA_INT_EARLY_RX             : Early receive interrupt
  *     @arg ETH_DMA_INT_FATAL_BUS_ERROR      : Fatal bus error interrupt
  *     @arg ETH_DMA_INT_EARLY_TX             : Early transmit interrupt
  *     @arg ETH_DMA_INT_RX_WDG_TIMEOUT       : Receive watchdog timeout interrupt
  *     @arg ETH_DMA_INT_RX_PROC_STOP         : Receive process stopped interrupt
  *     @arg ETH_DMA_INT_RX_BUF_UA            : Receive buffer unavailable interrupt
  *     @arg ETH_DMA_INT_RX                   : Receive interrupt
  *     @arg ETH_DMA_INT_TX_UNDERFLOW         : Underflow interrupt
  *     @arg ETH_DMA_INT_RX_OVERFLOW          : Overflow interrupt
  *     @arg ETH_DMA_INT_TX_JABBER_TIMEOUT    : Transmit jabber timeout interrupt
  *     @arg ETH_DMA_INT_TX_BUF_UA            : Transmit buffer unavailable interrupt
  *     @arg ETH_DMA_INT_TX_PROC_STOP         : Transmit process stopped interrupt
  *     @arg ETH_DMA_INT_TX                   : Transmit interrupt
  * @return None
  */
void ETH_DMAClearITPendingBit(uint32_t ETH_DMA_IT)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_INT(ETH_DMA_IT));

    /* Clear the selected ETHERNET DMA IT */
    ETH->DMASTS = (uint32_t) ETH_DMA_IT;
}

/**
  * @brief  Returns the ETHERNET DMA Transmit Process State.
  * @param  None
  * @return The new ETHERNET DMA Transmit Process State:
  *   This can be one of the following values:
  *     - ETH_DMA_TX_PROC_STOPPED   : Stopped - Reset or Stop Tx Command issued
  *     - ETH_DMA_TX_PROC_FETCHING  : Running - fetching the Tx descriptor
  *     - ETH_DMA_TX_PROC_WAITING   : Running - waiting for status
  *     - ETH_DMA_TX_PROC_READING   : Running - reading the data from host memory
  *     - ETH_DMA_TX_PROC_SUSPENDED : Suspended - Tx Descriptor unavailable
  *     - ETH_DMA_TX_PROC_CLOSING   : Running - closing Rx descriptor
  */
uint32_t ETH_GetTransmitProcessState(void)
{
    return ((uint32_t)(ETH->DMASTS & ETH_DMASTS_TPS)); 
}

/**
  * @brief  Returns the ETHERNET DMA Receive Process State.
  * @param  None
  * @return The new ETHERNET DMA Receive Process State:
  *   This can be one of the following values:
  *     - ETH_DMA_RX_PROC_STOPPED   : Stopped - Reset or Stop Rx Command issued
  *     - ETH_DMA_RX_PROC_FETCHING  : Running - fetching the Rx descriptor 
  *     - ETH_DMA_RX_PROC_WAITING   : Running - waiting for packet
  *     - ETH_DMA_RX_PROC_SUSPENDED : Suspended - Rx Descriptor unavailable
  *     - ETH_DMA_RX_PROC_CLOSING   : Running - closing descriptor
  *     - ETH_DMA_RX_PROC_QUEUING   : Running - queuing the receive frame into host memory
  */
uint32_t ETH_GetReceiveProcessState(void)
{
    return ((uint32_t)(ETH->DMASTS & ETH_DMASTS_RPS));
}

/**
  * @brief  Clears the ETHERNET transmit FIFO.
  * @param  None
  * @return None
  */
void ETH_FlushTransmitFIFO(void)
{
    /* Set the Flush Transmit FIFO bit */
    ETH->DMAOPMOD |= ETH_DMAOPMOD_FTF;
}

/**
  * @brief  Checks whether the ETHERNET flush transmit FIFO bit is cleared or not.
  * @param  None
  * @return The new state of ETHERNET flush transmit FIFO bit (SET or RESET).
  */
FlagStatus ETH_GetFlushTransmitFIFOStatus(void)
{
    FlagStatus bitstatus = RESET;
    if ((ETH->DMAOPMOD & ETH_DMAOPMOD_FTF) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus; 
}

/**
  * @brief  Enables or disables the DMA transmission.
  * @param  NewState: new state of the DMA transmission.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMATransmissionCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the DMA transmission */
        ETH->DMAOPMOD |= ETH_DMAOPMOD_ST;
    }
    else
    {
        /* Disable the DMA transmission */
        ETH->DMAOPMOD &= (~ETH_DMAOPMOD_ST);
    }
}

/**
  * @brief  Enables or disables the DMA reception.
  * @param  NewState: new state of the DMA reception.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_DMAReceptionCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the DMA reception */
        ETH->DMAOPMOD |= ETH_DMAOPMOD_SR;
    }
    else
    {
        /* Disable the DMA reception */
        ETH->DMAOPMOD &= (~ETH_DMAOPMOD_SR);
    }
}

/**
  * @brief  Checks whether the specified ETHERNET DMA overflow flag is set or not.
  * @param  ETH_DMA_Overflow: specifies the DMA overflow flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_DMA_OVERFLOW_RX_FIFO_COUNTER : Overflow for FIFO Overflows Counter
  *     @arg ETH_DMA_OVERFLOW_MISSED_FRAME_COUNTER : Overflow for Buffer Unavailable Missed Frame Counter
  * @return The new state of ETHERNET DMA overflow Flag (SET or RESET).
  */
FlagStatus ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_GET_OVERFLOW(ETH_DMA_Overflow));

