zhanzr/N32G45XVL-STB_V1_1/Driver/n32g45x_std_periph_driver/src/n32g457_eth.c
    /* Return SUCCESS */
    return ETH_SUCCESS;
}



/******************************************************************************/
/*                           Power Management(PMT) functions                  */
/******************************************************************************/

/**
  * @brief  Reset Wakeup frame filter register pointer.
  * @param  None
  * @return None
  */
void ETH_ResetWakeUpFrameFilterRegisterPointer(void)
{  
    /* Resets the Remote Wake-up Frame Filter register pointer to 0x0000 */
    ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_RWKUPFLTRST;
}

/**
  * @brief  Populates the remote wakeup frame registers.
  * @param  Buffer: Pointer on remote WakeUp Frame Filter Register buffer data (8 words).
  * @return None
  */
void ETH_SetWakeUpFrameFilterRegister(uint32_t *Buffer)
{
    __IO uint32_t i = 0;

    /* Fill Remote Wake-up Frame Filter register with Buffer data */
    for(i = 0; i < ETH_WAKEUP_REG_LEN; i++)
    {
        /* Write each time to the same register */
        ETH->MACRMTWUFRMFLT = Buffer[i];
    }
}

/**
  * @brief  Enables or disables any unicast packet filtered by the MAC address
  *   recognition to be a wake-up frame.
  * @param  NewState: new state of the MAC Global Unicast Wake-Up.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_GlobalUnicastWakeUpCmd(FunctionalState NewState)
{ 
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the MAC Global Unicast Wake-Up */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_GLBLUCAST;
    }
    else
    {
        /* Disable the MAC Global Unicast Wake-Up */
        ETH->MACPMTCTRLSTS &= (~ETH_MACPMTCTRLSTS_GLBLUCAST);
    }
}

/**
  * @brief  Checks whether the specified ETHERNET PMT flag is set or not.
  * @param  ETH_PMT_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg ETH_PMT_FLAG_RWKUPFILTRST : Wake-Up Frame Filter Register Pointer Reset 
  *     @arg ETH_PMT_FLAG_RWKPRCVD     : Wake-Up Frame Received 
  *     @arg ETH_PMT_FLAG_MGKPRCVD     : Magic Packet Received
  * @return The new state of ETHERNET PMT Flag (SET or RESET).
  */
FlagStatus ETH_GetPMTFlagStatus(uint32_t ETH_PMT_FLAG)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_PMT_GET_FLAG(ETH_PMT_FLAG));

    if ((ETH->MACPMTCTRLSTS & ETH_PMT_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
  * @brief  Enables or disables the MAC Wake-Up Frame Detection.
  * @param  NewState: new state of the MAC Wake-Up Frame Detection.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_WakeUpFrameDetectionCmd(FunctionalState NewState)
{ 
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the MAC Wake-Up Frame Detection */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_RWKPKTEN;
    }
    else
    {
        /* Disable the MAC Wake-Up Frame Detection */ 
        ETH->MACPMTCTRLSTS &= (~ETH_MACPMTCTRLSTS_RWKPKTEN);
    }
}

/**
  * @brief  Enables or disables the MAC Magic Packet Detection.
  * @param  NewState: new state of the MAC Magic Packet Detection.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_MagicPacketDetectionCmd(FunctionalState NewState)
{ 
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the MAC Magic Packet Detection */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_MGKPKTEN;
    }
    else
    {
        /* Disable the MAC Magic Packet Detection */ 
        ETH->MACPMTCTRLSTS &= (~ETH_MACPMTCTRLSTS_MGKPKTEN);
    }
}

/**
  * @brief  Enables or disables the MAC Power Down.
  * @param  NewState: new state of the MAC Power Down.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_PowerDownCmd(FunctionalState NewState)
{ 
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the MAC Power Down */
        /* This puts the MAC in power down mode */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_PWRDWN;
    }
    else
    {
        /* Disable the MAC Power Down */ 
        ETH->MACPMTCTRLSTS &= (~ETH_MACPMTCTRLSTS_PWRDWN);
    }
}



/******************************************************************************/
/*                              MMC functions                                 */
/******************************************************************************/

 /**
  * @brief  Enables or disables the MMC Counter Freeze.
  * @param  NewState: new state of the MMC Counter Freeze.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_MMCCounterFreezeCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the MMC Counter Freeze */
        ETH->MMCCTRL |= ETH_MMCCTRL_CNTFREEZ;
    }
    else
    {
        /* Disable the MMC Counter Freeze */
        ETH->MMCCTRL &= (~ETH_MMCCTRL_CNTFREEZ);
    }
}

/**
  * @brief  Enables or disables the MMC Reset On Read.
  * @param  NewState: new state of the MMC Reset On Read.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_MMCResetOnReadCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Enable the MMC Counter reset on read */
        ETH->MMCCTRL |= ETH_MMCCTRL_RSTONRD;
    }
    else
    {
        /* Disable the MMC Counter reset on read */
        ETH->MMCCTRL &= (~ETH_MMCCTRL_RSTONRD);
    }
}

/**
  * @brief  Enables or disables the MMC Counter Stop Rollover.
  * @param  NewState: new state of the MMC Counter Stop Rollover.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_MMCCounterRolloverCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        /* Disable the MMC Counter Stop Rollover */
        ETH->MMCCTRL &= (~ETH_MMCCTRL_CNTSTOPRO);
    }
    else
    {
        /* Enable the MMC Counter Stop Rollover */
        ETH->MMCCTRL |= ETH_MMCCTRL_CNTSTOPRO; 
    }
}

/**
  * @brief  Resets the MMC Counters.
  * @param  None
  * @return None
  */
void ETH_MMCCountersReset(void)
{
    /* Resets the MMC Counters */
    ETH->MMCCTRL |= ETH_MMCCTRL_CNTRST;
}

/**
  * @brief  Enables or disables the specified ETHERNET MMC interrupts.
  * @param  ETH_MMC_IT: specifies the ETHERNET MMC interrupt sources to be enabled or disabled.
  *   This parameter can be any combination of Tx interrupt or
  *   any combination of Rx interrupt (but not both)of the following values:
  *     @arg ETH_MMC_INT_TXGFRMIS    : When Tx good frame counter reaches half the maximum value
  *     @arg ETH_MMC_INT_TXMCOLGFIS  : When Tx good multi col counter reaches half the maximum value
  *     @arg ETH_MMC_INT_TXSCOLGFIS  : When Tx good single col counter reaches half the maximum value
  *     @arg ETH_MMC_INT_RXUCGFIS    : When Rx good unicast frames counter reaches half the maximum value
  *     @arg ETH_MMC_INT_RXALGNERFIS : When Rx alignment error counter reaches half the maximum value
  *     @arg ETH_MMC_INT_RXCRCERFIS  : When Rx crc error counter reaches half the maximum value
  * @param  NewState: new state of the specified ETHERNET MMC interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @return None
  */
void ETH_MMCITConfig(uint32_t ETH_MMC_IT, FunctionalState NewState)
{ 
    /* Check the parameters */
    assert_param(IS_ETH_MMC_INT(ETH_MMC_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if ((ETH_MMC_IT & (uint32_t)0x10000000) != (uint32_t)RESET)
    {
        /* Remove Register mak from IT */
        ETH_MMC_IT &= 0xEFFFFFFF;

        /* ETHERNET MMC Rx interrupts selected */
        if (NewState != DISABLE)
        {
            /* Enable the selected ETHERNET MMC interrupts */
            ETH->MMCRXINTMSK &= (~(uint32_t)ETH_MMC_IT);
        }
        else
        {
            /* Disable the selected ETHERNET MMC interrupts */
            ETH->MMCRXINTMSK |= ETH_MMC_IT;
        }
    }
    else
    {
        /* ETHERNET MMC Tx interrupts selected */
        if (NewState != DISABLE)
        {
            /* Enable the selected ETHERNET MMC interrupts */
            ETH->MMCTXINTMSK &= (~(uint32_t)ETH_MMC_IT);
        }
        else
        {
            /* Disable the selected ETHERNET MMC interrupts */
            ETH->MMCTXINTMSK |= ETH_MMC_IT;
        }
    }
}

/**
  * @brief  Checks whether the specified ETHERNET MMC IT is set or not.
  * @param  ETH_MMC_IT: specifies the ETHERNET MMC interrupt.
  *   This parameter can be one of the following values:
  *     @arg ETH_MMC_INT_TXGFRMIS    : When Tx good frame counter reaches half the maximum value
  *     @arg ETH_MMC_INT_TXMCOLGFIS  : When Tx good multi col counter reaches half the maximum value
  *     @arg ETH_MMC_INT_TXSCOLGFIS  : When Tx good single col counter reaches half the maximum value
  *     @arg ETH_MMC_INT_RXUCGFIS    : When Rx good unicast frames counter reaches half the maximum value
  *     @arg ETH_MMC_INT_RXALGNERFIS : When Rx alignment error counter reaches half the maximum value
  *     @arg ETH_MMC_INT_RXCRCERFIS  : When Rx crc error counter reaches half the maximum value
  * @return The value of ETHERNET MMC IT (SET or RESET).
  */
INTStatus ETH_GetMMCITStatus(uint32_t ETH_MMC_IT)
{
    INTStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_MMC_GET_INT(ETH_MMC_IT)); 

    if ((ETH_MMC_IT & (uint32_t)0x10000000) != (uint32_t)RESET)
    {
        /* ETHERNET MMC Rx interrupts selected */
        /* Check if the ETHERNET MMC Rx selected interrupt is enabled and occurred */
        if ((((ETH->MMCRXINT & ETH_MMC_IT) != (uint32_t)RESET)) && ((ETH->MMCRXINTMSK & ETH_MMC_IT) == (uint32_t)RESET))
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else
    {
        /* ETHERNET MMC Tx interrupts selected */
        /* Check if the ETHERNET MMC Tx selected interrupt is enabled and occurred */
        if ((((ETH->MMCTXINT & ETH_MMC_IT) != (uint32_t)RESET)) && ((ETH->MMCRXINTMSK & ETH_MMC_IT) == (uint32_t)RESET))
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }

    return bitstatus;
}

/**
  * @brief  Get the specified ETHERNET MMC register value.
  * @param  ETH_MMCReg: specifies the ETHERNET MMC register.
  *   This parameter can be one of the following values:
  *     @arg ETH_MMCCTRL        : MMC CR register
  *     @arg ETH_MMCRXINT       : MMC RIR register
  *     @arg ETH_MMCTXINT       : MMC TIR register
  *     @arg ETH_MMCRXINTMSK    : MMC RIMR register
  *     @arg ETH_MMCTXINTMSK    : MMC TIMR register
  *     @arg ETH_MMCTXGFASCCNT  : MMC TGFSCCR register
  *     @arg ETH_MMCTXGFAMSCCNT : MMC TGFMSCCR register
  *     @arg ETH_MMCTXGFCNT     : MMC TGFCR register
  *     @arg ETH_MMCRXFCECNT    : MMC RFCECR register
  *     @arg ETH_MMCRXFAECNT    : MMC RFAECR register
  *     @arg ETH_MMCRXGUFCNT    : MMC RGUFCRregister
  * @return The value of ETHERNET MMC Register value.
  */
uint32_t ETH_GetMMCRegister(uint32_t ETH_MMCReg)
{
    /* Check the parameters */
    assert_param(IS_ETH_MMC_REGISTER(ETH_MMCReg));

    /* Return the selected register value */
    return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_MMCReg));
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
